public class Main {
    public static void main(String[] args) {
        //1 - 2 задание
        int first = 27897;
        byte second = 67;
        short third = -159;
        long fourth = 987678965549L;
        float fifth = 2.786f;
        double sixth = 27.12;
        System.out.println("Значение переменной с типом int равно " + first + "!");
        System.out.println("Значение переменной с типом byte равно " + second + "!");
        System.out.println("Значение переменной с типом short равно " + third + "!");
        System.out.println("Значение переменной с типом long равно " + fourth + "!");
        System.out.println("Значение переменной с типом float равно " + fifth + "!");
        System.out.println("Значение переменной с типом double равно " + sixth + "!");
        //Задание 3(вспомнил, что забыл создать папку в самом начале ((

        var wholeCountOfStudents = 23 + 27 + 30;
        var paperCountPerStudent = 480 / wholeCountOfStudents;
        System.out.println("На каждого ученика рассчитано " + paperCountPerStudent + " листов бумаги");
        //программа компилируется !

        //задание 4

    }
}
